{
  "authors": [
    "Badis Belhadj-Chaidi",
    "Thomas Pedrotti"
  ],
  "category": "tool",
  "description": "Cancer classifying",
  "name": "Cancer",
  "source": "MISP Project",
  "type": "disease",
  "uuid": "c03eba6e-a08a-11ec-b909-0242ac120002",
  "values": [
    {
      "description": "Adenoid cystic carcinoma is a rare kind of cancer that usually starts in the glands that make saliva. These are under your tongue and on each side of your jaw below the jawbone. But it also can occur in other parts of your mouth and throat or other areas of your body, such as your sweat glands or tear glands.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/adenoid-cystic-carcinoma-facts"
        ]
      },
      "uuid": "cd28ecc2-a08a-11ec-b909-0242ac120002",
      "value": "Adenoid Cystic Carcinoma "
    },
    {
      "description": "Adrenal cancer is part of a group of tumors called neuroendocrine tumors (NETs). These can start in hormone-producing glands all over your body. Adrenal cancer starts in small glands called adrenal glands. You have two of them, one on top of each kidney. Cancer can happen in one or both.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/adrenal-cancer"
        ]
      },
      "uuid": "cd28ee02-a08a-11ec-b909-0242ac120002",
      "value": "Adrenal Gland Cancer"
    },
    {
      "description": "Amyloidosis is when an abnormal protein called amyloid builds up in your tissues and organs. When it does, it affects their shape and how they work. Amyloidosis is a serious health problem that can lead to life-threatening organ failure.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/amyloidosis-symptoms-causes-treatments#1"
        ]
      },
      "uuid": "cd28ef4c-a08a-11ec-b909-0242ac120002",
      "value": "Amyloidosis"
    },
    {
      "description": "Anal cancer is an uncommon malignancy that starts in the anus -- the opening at the end of the rectum.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-anal-cancer"
        ]
      },
      "uuid": "cd28f078-a08a-11ec-b909-0242ac120002",
      "value": "Anal Cancer"
    },
    {
      "description": "Ataxia is a movement disorder caused by problems in the brain. When you have ataxia, you have trouble moving parts of your body the way you want. Or the muscles in your arms and legs might move when you don’t want them to. The word ataxia actually means “without coordination.”",
      "meta": {
        "refs": [
          "https://www.webmd.com/brain/ataxia-types-brain-and-nervous-system"
        ]
      },
      "uuid": "cd28f1ae-a08a-11ec-b909-0242ac120002",
      "value": "Ataxia-Telangiectasia"
    },
    {
      "description": "Moles, which usually look like small brown spots, are just groups of cells. The average adult has between 10 and 45 of them on their body. Most aren’t dangerous. Some go away as you get older. But how do you know if yours are normal? The best way is to look for specific features or changes that mean you should get a mole checked out.",
      "meta": {
        "refs": [
          "https://www.webmd.com/melanoma-skin-cancer/skin-mole-normal"
        ]
      },
      "uuid": "cd28f2d0-a08a-11ec-b909-0242ac120002",
      "value": "Atypical Mole Syndrome"
    },
    {
      "description": "Basal cell carcinoma is a cancer that grows on parts of your skin that get a lot of sun. It's natural to feel worried when your doctor tells you that you have it, but keep in mind that it's the least risky type of skin cancer. As long as you catch it early, you can be cured.",
      "meta": {
        "refs": [
          "https://www.webmd.com/melanoma-skin-cancer/melanoma-guide/basal-cell-carcinoma#1"
        ]
      },
      "uuid": "cd28f708-a08a-11ec-b909-0242ac120002",
      "value": "Basal Cell Carcinoma"
    },
    {
      "description": "Bile duct cancer, also called cholangiocarcinoma, is when unusual cells grow out of control inside your bile ducts. Those are thin tubes about 4 to 5 inches long that move a fluid called bile from your liver to your gallbladder and small intestine. Bile helps you digest fat in the food you eat.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/bile-duct-cancer"
        ]
      },
      "uuid": "cd28f852-a08a-11ec-b909-0242ac120002",
      "value": "Bile Duct Cancer"
    },
    {
      "description": "If your doctor tells you that you have cystic lung disease, it means you have one of a group of conditions that cause lung cysts -- sacs of tissue filled with air or fluid. Treatments can help, but your options depend on which type you have.",
      "meta": {
        "refs": [
          "https://www.webmd.com/lung/what-is-cystic-lung-disease"
        ]
      },
      "uuid": "cd28f974-a08a-11ec-b909-0242ac120002",
      "value": "Birt Hogg Dube Syndrome"
    },
    {
      "description": "The bladder is a hollow, flexible pouch in your pelvis. Its main job is to store urine before it leaves your body. Your kidneys make pee. Tubes called ureters carry the pee from your kidneys to your bladder. When you use the bathroom, the muscles in your bladder push the urine out through a tube called the urethra.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/bladder-cancer/default.htm"
        ]
      },
      "uuid": "cd28fa82-a08a-11ec-b909-0242ac120002",
      "value": "Bladder Cancer"
    },
    {
      "description": "Bone cancer is when unusual cells grow out of control in your bone. It destroys normal bone tissue. It may start in your bone or spread there from other parts of your body (called metastasis).",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/bone-tumors"
        ]
      },
      "uuid": "cd28fb9a-a08a-11ec-b909-0242ac120002",
      "value": "Bone Cancer"
    },
    {
      "description": "Brain tumors are abnormal growths of cells in the brain. Although such growths are popularly called brain tumors, not all brain tumors are cancer. Cancer is a term reserved for malignant tumors. Malignant tumors can grow and spread aggressively, overpowering healthy cells by taking their space, blood, and nutrients. They can also spread to distant parts of the body. Like all cells of the body, tumor cells need blood and nutrients to survive.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/brain-cancer/default.htm"
        ]
      },
      "uuid": "cd28fd02-a08a-11ec-b909-0242ac120002",
      "value": "Brain Tumor"
    },
    {
      "description": "Like all forms of cancer, breast cancer is made of unusual cells that grow out of control. Those cells may also travel to places in your body where they aren’t usually found. When that happens, the cancer is called metastatic.",
      "meta": {
        "refs": [
          "https://www.webmd.com/breast-cancer/default.htm"
        ]
      },
      "uuid": "cd28fe38-a08a-11ec-b909-0242ac120002",
      "value": "Breast Cancer"
    },
    {
      "description": "Even though men don't have breasts like women’s, they have a small amount of breast tissue. The \"breasts\" of a man are similar to the breasts of a girl before puberty. Girls’ tissue grows and develops, but men’s doesn't. But because they still have breast tissue, men can get breast cancer. Men get the same types of breast cancers that women do, but cancers involving the parts that make and store milk are rare. The risk of a man getting breast cancer in his lifetime is about 1 per 1,000.",
      "meta": {
        "refs": [
          "https://www.webmd.com/breast-cancer/breast-cancer-men"
        ]
      },
      "uuid": "cd28ff5a-a08a-11ec-b909-0242ac120002",
      "value": "Breast Cancer in Men"
    },
    {
      "description": "If your doctor tells you that you've got a carcinoid tumor, there's a lot to take in. The condition is a type of cancer, but unlike some other kinds, there's more than one part of the body where it might start. And depending on where you get it, you could have a bunch of different symptoms, from pain in your belly to a bad cough. All carcinoid tumors, wherever they show up, affect cells that make hormones. They're part of a group of diseases called neuroendocrine tumors (NETs).",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/carcinoid-tumors"
        ]
      },
      "uuid": "cd29023e-a08a-11ec-b909-0242ac120002",
      "value": "Carcinoid Tumor"
    },
    {
      "description": "Cervical cancer happens when cells change in women’s cervix, which connects the uterus and vagina. This cancer can affect the deeper tissues of their cervix and may spread to other parts of their body (metastasize), often the lungs, liver, bladder, vagina, and rectum.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/cervical-cancer/default.htm"
        ]
      },
      "uuid": "cd290392-a08a-11ec-b909-0242ac120002",
      "value": "Cervical Cancer"
    },
    {
      "description": "Colorectal cancer, sometimes called colon cancer, starts when cells that line your colon or rectum grow out of control. It’s the third leading cause of cancer deaths among American men and women.",
      "meta": {
        "refs": [
          "https://www.webmd.com/colorectal-cancer/default.htm"
        ]
      },
      "uuid": "cd2904be-a08a-11ec-b909-0242ac120002",
      "value": "Colorectal Cancer"
    },
    {
      "description": "Ductal carcinoma is a common type of breast cancer that starts in cells that line the milk ducts, which carry breast milk to the nipple.",
      "meta": {
        "refs": [
          "https://www.webmd.com/breast-cancer/guide/ductal-carcinoma-invasive-in-situ"
        ]
      },
      "uuid": "cd2905d6-a08a-11ec-b909-0242ac120002",
      "value": "Ductal Carcinoma"
    },
    {
      "description": "Cancer can affect the uterus, the hollow, pear-shaped organ where a baby grows. The uterus is lined with a special tissue called the endometrium. When cancer grows in this lining, it is called endometrial cancer. Most cancers of the uterus are endometrial cancer.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/understanding-endometrial-cancer-basics"
        ]
      },
      "uuid": "cd29070c-a08a-11ec-b909-0242ac120002",
      "value": "Endometrial Cancer"
    },
    {
      "description": "Esophageal cancer occurs when cancer cells develop in the esophagus, a tube-like structure that runs from your throat to your stomach. Food goes from the mouth to the stomach through the esophagus. The cancer starts at the inner layer of the esophagus and can spread throughout the other layers of the esophagus and to other parts of the body (metastasis).",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/esophageal-cancer"
        ]
      },
      "uuid": "cd2908ba-a08a-11ec-b909-0242ac120002",
      "value": "Esophageal Cancer"
    },
    {
      "description": "Stomach cancer begins when cancer cells form in the inner lining of your stomach. These cells can grow into a tumor. Also called gastric cancer, the disease usually grows slowly over many years. Stomach cancer is most often seen in people in their late 60s through 80s.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/stomach-gastric-cancer"
        ]
      },
      "uuid": "cd290a2c-a08a-11ec-b909-0242ac120002",
      "value": "Gastric Cancer"
    },
    {
      "description": "Gastrointestinal stromal tumor is a type of cancer known as a soft tissue sarcoma that affects the GI tract. However, GIST has become a treatable disease over time. Maintaining a healthy lifestyle and following doctor’s orders will help improve your treatment experience.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/daily-life-with-gist"
        ]
      },
      "uuid": "cd290d38-a08a-11ec-b909-0242ac120002",
      "value": "Gastrontestinal Stromal Tumor - GIST"
    },
    {
      "description": "HER2-positive breast cancer is when breast cancer cells have a protein receptor called HER2 (human epidermal growth factor receptor 2). Normally, this protein helps breast cells grow, divide, and repair themselves. But sometimes, something goes wrong in the gene that controls the HER2 protein and your body makes too many of these receptors. This causes your breast cells to grow and divide uncontrollably. About 1 of 5 breast cancers are HER2-positive.",
      "meta": {
        "refs": [
          "https://www.webmd.com/breast-cancer/her2"
        ]
      },
      "uuid": "cd291184-a08a-11ec-b909-0242ac120002",
      "value": "HER2-Positive Breast Cancer"
    },
    {
      "description": "Pancreatic NETs grow in your pancreas, a gland in your belly that has two big jobs. It makes juices to digest food, and it makes hormones, which are chemicals that control different actions in your body. NETs grow in the cells that make hormones.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/pancreatic-neuroendocrine-tumors-nets"
        ]
      },
      "uuid": "cd2912b0-a08a-11ec-b909-0242ac120002",
      "value": "Islet Cell Tumor"
    },
    {
      "description": "One of the risk factors for colorectal cancer is a family history of the disease. Colorectal cancer is called \"hereditary\" or \"inherited\" when several generations of a family have it. Experts have found gene changes (also known as mutations or abnormalities) that cause colorectal cancer.",
      "meta": {
        "refs": [
          "https://www.webmd.com/colorectal-cancer/guide/inherited-colorectal-cancer"
        ]
      },
      "uuid": "cd2913c8-a08a-11ec-b909-0242ac120002",
      "value": "Juvenile Polyposis Syndrome"
    },
    {
      "description": "Kidney cancer -- also called renal cancer -- is a disease in which kidney cells become malignant (cancerous) and grow out of control, forming a tumor. Almost all kidney cancers first appear in the lining of tiny tubes (tubules) in the kidney. This type of kidney cancer is called renal cell carcinoma.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/understanding-kidney-cancer"
        ]
      },
      "uuid": "cd2914e0-a08a-11ec-b909-0242ac120002",
      "value": "Kidney Cancer"
    },
    {
      "description": "Laryngeal cancer develops when cancer cells form in the tissue of the larynx, or voice box. It’s one of the most common types of head and neck cancers, affecting about 12,620 adults in the U.S. each year. Men are almost four times more likely to be diagnosed with it than women.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-laryngeal-cancer"
        ]
      },
      "uuid": "cd2915f8-a08a-11ec-b909-0242ac120002",
      "value": "Laryngeal Cancer"
    },
    {
      "description": "B-cell acute lymphoblastic leukemia is a cancer that affects your \"B lymphocytes\" -- white blood cells that grow in the soft center of your bones, called marrow.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/b-cell-acute-lymphoblastic-leukemia-adults#1"
        ]
      },
      "uuid": "cd291710-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Acute Lymphoblastic Leukemia"
    },
    {
      "description": "Acute lymphoblastic leukemia (ALL) is a type of blood cancer that starts in white blood cells in your bone marrow, the soft inner part of your bones. It develops from immature lymphocytes, a kind of white blood cell that’s key to your immune system. ALL is also known as acute lymphocytic leukemia or acute lymphoid leukemia. ”Acute” means it gets worse quickly. It’s a rare type of leukemia, or blood cancer, in adults but the most common type in children.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/acute-lymphoblastic-leukemia"
        ]
      },
      "uuid": "cd291828-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Acute Lymphocytic (ALL)"
    },
    {
      "description": "Acute myeloid leukemia (AML) is a type of blood cancer. It starts in your bone marrow, the soft inner parts of bones. AML usually begins in cells that turn into white blood cells, but it can start in other blood-forming cells, as well.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/acute-myeloid-leukemia-symptoms-treatments#1"
        ]
      },
      "uuid": "cd291aee-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Acute Myeloid AML"
    },
    {
      "description": "Leukemia is a blood cancer caused by a rise in the number of white blood cells in your body. Those white blood cells crowd out the red blood cells and platelets that your body needs to be healthy. The extra white blood cells don’t work right.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/understanding-leukemia-basics"
        ]
      },
      "uuid": "cd291c1a-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Adult"
    },
    {
      "description": "Childhood leukemia, the most common type of cancer in children and teens, is a cancer of the white blood cells. Abnormal white blood cells form in the bone marrow. They quickly travel through the bloodstream and crowd out healthy cells. This raises the body's chances of infection and other problems.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/childhood-leukemia-symptoms-treatments"
        ]
      },
      "uuid": "cd291d3c-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Childhood"
    },
    {
      "description": "Chronic lymphocytic leukemia (CLL) is a cancer that affects a type of white blood cell called a \"lymphocyte.\" Lymphocytes help your body fight infection. They're made in the soft center of your bones, called the marrow. If you have CLL, your body makes an abnormally high number of lymphocytes that aren't working right.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/chronic-lymphocytic-leukemia-rare#1"
        ]
      },
      "uuid": "cd291e54-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Chronic Lymphocytic - CLL"
    },
    {
      "description": "Chronic myelogenous leukemia (CML) is a cancer that affects your blood cells and bone marrow -- the soft part inside your bones where blood cells are made. You may also hear your doctor call it chronic myeloid leukemia. It's the same disease, just a different name.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/cml-need-to-know-first"
        ]
      },
      "uuid": "cd291f76-a08a-11ec-b909-0242ac120002",
      "value": "Leukemia - Chronic Myeloid - CML"
    },
    {
      "description": "The liver continuously filters blood that circulates through the body, converting nutrients and drugs absorbed from the digestive tract into ready-to-use chemicals. The liver performs many other important functions, such as removing toxins and other chemical waste products from the blood and readying them for excretion. Because all the blood in the body must pass through it, the liver is unusually accessible to cancer cells traveling in the bloodstream.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/understanding-liver-cancer-basic-information"
        ]
      },
      "uuid": "cd2921f6-a08a-11ec-b909-0242ac120002",
      "value": "Liver Cancer"
    },
    {
      "description": "Invasive lobular carcinoma (ILC) is breast cancer that begins in one of the glands that make milk, called lobules, and spreads to other parts of the breast. It’s the second most common form of breast cancer after invasive ductal carcinoma, which begins in a milk duct.",
      "meta": {
        "refs": [
          "https://www.webmd.com/breast-cancer/guide/lobular-carcinoma-invasive-and-in-situ"
        ]
      },
      "uuid": "cd292336-a08a-11ec-b909-0242ac120002",
      "value": "Lobular Carcinoma"
    },
    {
      "description": "It’s cancer that starts in your lungs and can spread to other parts of your body. Although it’s the top cause of cancer deaths for U.S. men and women, it’s also one of the most preventable kinds, by not smoking and avoiding other people’s secondhand smoke.",
      "meta": {
        "refs": [
          "https://www.webmd.com/lung-cancer/default.htm"
        ]
      },
      "uuid": "cd29244e-a08a-11ec-b909-0242ac120002",
      "value": "Lung Cancer"
    },
    {
      "description": "When cells of the lung start growing rapidly in an uncontrolled manner, the condition is called lung cancer. Cancer can affect any part of the lung, and it's the leading cause of cancer deaths in both women and men in the United States, Canada, and China. There are two main types of lung cancer. Small-cell lung cancer (SCLC), sometimes called small-cell carcinoma, causes about 10%-15% of all lung cancer. Non-small-cell lung cancer (NSCLC) causes the rest.",
      "meta": {
        "refs": [
          "https://www.webmd.com/lung-cancer/small-cell-lung-cancer"
        ]
      },
      "uuid": "cd29278c-a08a-11ec-b909-0242ac120002",
      "value": "Lung Cancer - Small Cell"
    },
    {
      "description": "Hodgkin lymphoma, also known as Hodgkin's disease, is a type of lymphoma, a cancer of the lymphatic system.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/understanding-hodgkins-disease-basic-information"
        ]
      },
      "uuid": "cd2928c2-a08a-11ec-b909-0242ac120002",
      "value": "Lymphoma - Hodgkin's"
    },
    {
      "description": "Lymphoma occurs when the lymph-node cells or the lymphocytes begin to multiply uncontrollably, producing cancerous cells that have the abnormal capacity to invade other tissues throughout the body. Non-Hodgkin lymphoma is further classified into a variety of subtypes based on the cell of origin (B-cell or T-cell), and the cell characteristics.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/understanding-non-hodgkins-lymphoma-basics"
        ]
      },
      "uuid": "cd292a52-a08a-11ec-b909-0242ac120002",
      "value": "Lymphoma - Non-Hodgkin's"
    },
    {
      "description": "Glioma is a broad category of brain and spinal cord tumors that come from glial cells brain cells that support nerve cells.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/brain-cancer/malignant-gliomas"
        ]
      },
      "uuid": "cd292bb0-a08a-11ec-b909-0242ac120002",
      "value": "Malignant Glioma"
    },
    {
      "description": "There are three major types of skin cancers: basal cell carcinoma (BCC), squamous cell carcinoma (SCC), and melanoma.",
      "meta": {
        "refs": [
          "https://www.webmd.com/melanoma-skin-cancer/default.htm"
        ]
      },
      "uuid": "cd292cc8-a08a-11ec-b909-0242ac120002",
      "value": "Melanoma"
    },
    {
      "description": "A meningioma is a tumor that forms on membranes that cover the brain and spinal cord just inside the skull.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/brain-cancer/meningioma-causes-symptoms-treatment"
        ]
      },
      "uuid": "cd292de0-a08a-11ec-b909-0242ac120002",
      "value": "Meningioma"
    },
    {
      "description": "Multiple myeloma, also known as Kahler's disease, is a type of blood cancer. There's no cure, but treatments can slow its spread and sometimes make symptoms go away.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/multiple-myeloma/guide/multiple-myeloma-symptoms-causes-treatment"
        ]
      },
      "uuid": "cd292f02-a08a-11ec-b909-0242ac120002",
      "value": "Multiple Myeloma"
    },
    {
      "description": "Myelodysplastic syndromes are a rare group of disorders in which your body no longer makes enough healthy blood cells. You might sometimes hear it called a “bone marrow failure disorder.”",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/lymphoma/myelodysplastic-syndrome-causes-symptoms-treatment"
        ]
      },
      "uuid": "cd29301a-a08a-11ec-b909-0242ac120002",
      "value": "Myelodysplastic Syndrome (MDS)"
    },
    {
      "description": "MNasopharyngeal cancer is a rare type of head and neck cancer. It starts in the upper part of your throat, behind the nose. This area is called the nasopharynx.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/nasopharyngeal-cancer"
        ]
      },
      "uuid": "cd2934c0-a08a-11ec-b909-0242ac120002",
      "value": "Nasopharyngeal Cancer"
    },
    {
      "description": "When you first hear that you've got a neuroendocrine tumor, you'll have lots of questions about what it is and how it will affect you. There are quite a few types of this disease, and it can show up in many places in your body.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/neuroendocrine-tumors"
        ]
      },
      "uuid": "cd293628-a08a-11ec-b909-0242ac120002",
      "value": "Neuroendocrine Tumor"
    },
    {
      "description": "Oral cancer appears as a growth or sore in the mouth that does not go away. About 50,000 people in the U.S. get oral cancer each year, 70% of them men. Oral cancer includes cancers of the lips, tongue, cheeks, floor of the mouth, hard and soft palate, sinuses, and pharynx (throat. It can be life-threatening if not diagnosed and treated early.",
      "meta": {
        "refs": [
          "https://www.webmd.com/oral-health/guide/oral-cancer"
        ]
      },
      "uuid": "cd293768-a08a-11ec-b909-0242ac120002",
      "value": "Oral Cancer"
    },
    {
      "description": "Osteosarcoma, also called osteogenic sarcoma, is a kind of bone cancer. It happens when the cells that grow new bone form a cancerous tumor. Treatment -- chemotherapy and surgery to take out the tumor -- is usually successful when the disease is diagnosed early, before it can spread.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-osteosarcoma"
        ]
      },
      "uuid": "cd2938a8-a08a-11ec-b909-0242ac120002",
      "value": "Osteosarcoma"
    },
    {
      "description": "Ovarian cancer happens when cells that are not normal grow in one or both of your ovaries, two small glands located on either side of your uterus.",
      "meta": {
        "refs": [
          "https://www.webmd.com/ovarian-cancer/guide/ovarian-cancer-overview-facts"
        ]
      },
      "uuid": "cd2939ca-a08a-11ec-b909-0242ac120002",
      "value": "Ovarian Cancer"
    },
    {
      "description": "Pancreatic cancer is classified according to which part of the pancreas is affected: the part that makes digestive substances (exocrine) or the part that makes insulin and other hormones (endocrine).",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/pancreatic-cancer/information-pancreatic-cancer"
        ]
      },
      "uuid": "cd293ae2-a08a-11ec-b909-0242ac120002",
      "value": "Pancreatic Cancer"
    },
    {
      "description": "Pancreatic NETs grow in your pancreas, a gland in your belly that has two big jobs. It makes juices to digest food, and it makes hormones, which are chemicals that control different actions in your body. NETs grow in the cells that make hormones.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/pancreatic-neuroendocrine-tumors-nets"
        ]
      },
      "uuid": "cd293bfa-a08a-11ec-b909-0242ac120002",
      "value": "Pancreatic Neuroendocrine Tumors"
    },
    {
      "description": "The parathyroid glands are four tiny glands attached to the thyroid. They are located under the Adam’s apple in your neck.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/parathyroid-cancer"
        ]
      },
      "uuid": "cd293d1c-a08a-11ec-b909-0242ac120002",
      "value": "Parathyroid Cancer"
    },
    {
      "description": "Penile Cancer is cancer that starts in the penis, the outer part of the man's sexual tract. Most penile cancers start in a flat type of skin cell called a squamous cell. Squamous cell penile cancer usually grows slowly.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/penile-cancer-directory"
        ]
      },
      "uuid": "cd294032-a08a-11ec-b909-0242ac120002",
      "value": "Penile Cancer"
    },
    {
      "description": "Peritoneal cancer is a rare cancer. It develops in a thin layer of tissue that lines the abdomen. It also covers the uterus, bladder, and rectum.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/peritoneal-cancer-prognosis-symptoms-treatments"
        ]
      },
      "uuid": "cd294262-a08a-11ec-b909-0242ac120002",
      "value": "Peritoneal Cancer"
    },
    {
      "description": "Scattered dark brown macules appear on the lips of an adult with Peutz-Jeghers syndrome. These macules also appear inside the mouth. Pigmented macules on the lips may fade with time, but the intraoral pigmentation persists for life.",
      "meta": {
        "refs": [
          "https://www.webmd.com/skin-problems-and-treatments/picture-of-peutz-jeghers-syndrome"
        ]
      },
      "uuid": "cd2943b6-a08a-11ec-b909-0242ac120002",
      "value": "Peutz-Jeghers Syndrome"
    },
    {
      "description": "A pituitary gland tumor is a group of abnormal cells that grows out of control in your pituitary gland. Most of these tumors are not cancerous. Pituitary cancer is very rare.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/brain-cancer/pituitary-gland-tumors"
        ]
      },
      "uuid": "cd2944e2-a08a-11ec-b909-0242ac120002",
      "value": "Pituitary Gland Tumor"
    },
    {
      "description": "Polycythemia vera (PV) is a blood cancer that begins in the marrow of your bones, the soft center where new blood cells grow. It causes your marrow to make too many red blood cells so your blood is too thick.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/polycythemia-vera"
        ]
      },
      "uuid": "cd294604-a08a-11ec-b909-0242ac120002",
      "value": "Polycythemia Vera"
    },
    {
      "description": "Cancer of the prostate, a gland in the male reproductive system, is a major health concern for American men. The disease is rare before age 50, and experts believe most elderly men have traces of it.",
      "meta": {
        "refs": [
          "https://www.webmd.com/prostate-cancer/guide/prostate-cancer-overview-facts"
        ]
      },
      "uuid": "cd294712-a08a-11ec-b909-0242ac120002",
      "value": "Prostate Cancer"
    },
    {
      "description": "It's the most common type of kidney cancer. Although it’s a serious disease, finding and treating it early makes it more likely that you’ll be cured. No matter when you’re diagnosed, you can do certain things to ease your symptoms and feel better during your treatment.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/renal-cell-carcinoma"
        ]
      },
      "uuid": "cd29483e-a08a-11ec-b909-0242ac120002",
      "value": "Renal Cell Carcinoma"
    },
    {
      "description": "This is a rare form of eye cancer that usually happens in childhood. It starts in the retina -- the part of the eye that senses light and sends pictures to the brain.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-retinoblastoma"
        ]
      },
      "uuid": "cd294960-a08a-11ec-b909-0242ac120002",
      "value": "Retinoblastoma"
    },
    {
      "description": "You have hundreds of salivary glands in and around your mouth. Some are so small you can only see them with the help of a microscope. Because there are so many salivary glands, and so many types of cells in those glands, there are also hundreds of types of salivary gland cancer. Most of them are extremely rare, and more than half of salivary gland tumors turn out to be benign (not cancer).",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/salivary-gland-cancer"
        ]
      },
      "uuid": "cd294c94-a08a-11ec-b909-0242ac120002",
      "value": "Salivary Gland Cancer"
    },
    {
      "description": "A sarcoma is a rare kind of cancer. Sarcomas are different from the much more common carcinomas because they happen in a different kind of tissue. Sarcomas grow in connective tissue -- cells that connect or support other kinds of tissue in your body. These tumors are most common in the bones, muscles, tendons, cartilage, nerves, fat, and blood vessels of your arms and legs, but they can also happen in other areas of your body..",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/sarcoma"
        ]
      },
      "uuid": "cd294dc0-a08a-11ec-b909-0242ac120002",
      "value": "Sarcoma"
    },
    {
      "description": "Kaposi’s sarcoma (KS) is a form of cancer in which tumors with tiny blood vessels grow below the surface of your skin and in your mouth, nose, eyes, and anus. It can spread to your lungs, liver, stomach, intestines, and lymph nodes, the glands that help your body fight infection.",
      "meta": {
        "refs": [
          "https://www.webmd.com/hiv-aids/guide/aids-hiv-opportunistic-infections-kaposis-sarcoma"
        ]
      },
      "uuid": "cd294ee2-a08a-11ec-b909-0242ac120002",
      "value": "Sarcoma - Kaposi"
    },
    {
      "description": "Skin cancer is the most common of all human cancers. In 2020, more than 100,000 people in the U.S. are expected to be diagnosed with some type of the disease. Nearly 7,000 are expected to die.",
      "meta": {
        "refs": [
          "https://www.webmd.com/melanoma-skin-cancer/melanoma-guide/skin-cancer#1"
        ]
      },
      "uuid": "cd294ffa-a08a-11ec-b909-0242ac120002",
      "value": "Skin Cancer"
    },
    {
      "description": "Small intestine cancer is a rare disease where cells in the tissue of the small intestine change. They grow out of control and can form a mass, or tumor.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/cancer-of-the-small-intestine"
        ]
      },
      "uuid": "cd295112-a08a-11ec-b909-0242ac120002",
      "value": "Small Intestine Cancer"
    },
    {
      "description": "Stomach cancer begins when cancer cells form in the inner lining of your stomach. These cells can grow into a tumor. Also called gastric cancer, the disease usually grows slowly over many years. Stomach cancer is most often seen in people in their late 60s through 80s.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/stomach-gastric-cancer"
        ]
      },
      "uuid": "cd29522a-a08a-11ec-b909-0242ac120002",
      "value": "Stomach Cancer"
    },
    {
      "description": "Cancer can occur in many areas of the body, including the sexual organs. Men have two testicles, sometimes called testes. They are one of many glands in the body. Their job is to make male hormones and sperm. They hang beneath and behind a man's penis in a pouch of skin called the scrotum.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/understanding-testicular-cancer-basics"
        ]
      },
      "uuid": "cd295338-a08a-11ec-b909-0242ac120002",
      "value": "Testicular Cancer"
    },
    {
      "description": "Thymoma and thymic carcinoma are two types of thymus cancer. The thymus is a small organ in the upper chest. It’s in front of and above the heart. It makes white blood cells that help your body fight infection.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/thymoma-thymic-carcinoma"
        ]
      },
      "uuid": "cd295658-a08a-11ec-b909-0242ac120002",
      "value": "Thymoma"
    },
    {
      "description": "Thyroid cancer develops when cells change or mutate. The abnormal cells begin multiplying in your thyroid and, once there are enough of them, they form a tumor.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-thyroid-cancer"
        ]
      },
      "uuid": "cd2957ac-a08a-11ec-b909-0242ac120002",
      "value": "Thyroid Cancer"
    },
    {
      "description": "Cancer can affect the uterus, the hollow, pear-shaped organ where a baby grows. The uterus is lined with a special tissue called the endometrium. When cancer grows in this lining, it is called endometrial cancer. Most cancers of the uterus are endometrial cancer.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/understanding-endometrial-cancer-basics"
        ]
      },
      "uuid": "cd29591e-a08a-11ec-b909-0242ac120002",
      "value": "Uterine (Endometrial) Cancer"
    },
    {
      "description": "Vaginal cancer happens when cancerous cells grow in your vagina.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-vaginal-cancer"
        ]
      },
      "uuid": "cd295a40-a08a-11ec-b909-0242ac120002",
      "value": "Vaginal Cancer"
    },
    {
      "description": "A Wilms tumor (also called a nephroblastoma) is the most common kidney cancer in children. Most children with it have a tumor on one kidney, but about 5% get a tumor on both.",
      "meta": {
        "refs": [
          "https://www.webmd.com/cancer/what-is-wilms-tumor"
        ]
      },
      "uuid": "cd295b58-a08a-11ec-b909-0242ac120002",
      "value": "Wilms' Tumor "
    }
  ],
  "version": 1
}
