{
  "authors": [
    "MISP Trainer"
  ],
  "category": "training",
  "description": "Popular movie sub-genres.",
  "name": "Movie",
  "source": "MISP Project",
  "type": "movie",
  "uuid": "d56bee7b-4050-449e-8366-183742cefbc3",
  "values": [
    {
      "description": "A story about a war or battle that can either be historical or fictional. It usually follows the events a certain warrior goes through during the battle's events.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Action"
        ]
      },
      "uuid": "8fc1b83b-0f73-407a-8e7b-35ef81b99b37",
      "value": "Military fiction"
    },
    {
      "description": "A story about a secret agent (spy) or military personnel member who is sent on an espionage mission. Usually, they are equipped with special gadgets that prove useful during the mission, and they have special training in things such as unarmed combat or computer hacking. They may or may not work for a specific government.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Action"
        ]
      },
      "uuid": "f2b6243b-0c89-4a48-b729-08527862b652",
      "value": "Spy fiction"
    },
    {
      "description": "A martial arts genre with chivalrous protagonists on fantastic adventures.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Action"
        ]
      },
      "uuid": "ab8374cb-0d23-4da3-b79d-44894991ea33",
      "value": "Wuxia"
    },
    {
      "description": "A subgenre of fantasy that is primarily humorous in intent and tone. Usually set in imaginary worlds, comic fantasy often includes puns on and parodies of other works of fantasy. It is sometimes known as low fantasy in contrast to high fantasy, which is primarily serious in intent and tone. The term \"low fantasy\" is also used to represent other types of fantasy, so while comic fantasies may also correctly be classified as low fantasy, many examples of low fantasy are not comic in nature.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Comedy"
        ]
      },
      "uuid": "594cbadb-428c-4fed-abc6-9e08cd2c1f1a",
      "value": "Comic fantasy"
    },
    {
      "description": "A parody or satirical story that is based on normally tragic or taboo subjects, including death, murder, suicide, illicit drugs and war. So-called \"dead baby comedy\" sometimes falls under this genre.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Comedy"
        ],
        "synonym": "Dark comedy"
      },
      "uuid": "ec0fe135-9dd3-4771-8a4f-de1323b330ec",
      "value": "Black comedy"
    },
    {
      "description": "Often strictly defined as a literary genre or form, though in practice it is also found in the graphic and performing arts. In satire, human or individual vices, follies, abuses, or shortcomings are held up to censure by means of ridicule, derision, burlesque, irony, or other methods, ideally with the intent to bring about improvement. Satire is usually meant to be funny, but its purpose is not primarily humour as an attack on something the author disapproves of, using wit. A common, almost defining feature of satire is its strong vein of irony or sarcasm, but parody, burlesque, exaggeration, juxtaposition, comparison, analogy, and double entendre all frequently appear in satirical speech and writing. The essential point, is that \"in satire, irony is militant.\" This \"militant irony\" (or sarcasm) often professes to approve (or at least accept as natural) the very things the satirist actually wishes to attack.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Comedy"
        ]
      },
      "uuid": "fd90fc0e-4e58-420c-9ac0-74be1fbb2fe6",
      "value": "Satire"
    },
    {
      "description": "Literature that focuses on gangs, criminal organizations that provide a level of organization, and resources that support much larger and more complex criminal transactions than an individual criminal could achieve. Gangsters are the subject of many movies, particularly from the period between 1930 and 1960. A revival of gangster type movies took place since the 1990s with the explosion of hip-hop culture. Unlike the earlier gangster films, the newer films share similar elements to the older films but is more in a hip-hop urban setting.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Crime"
        ]
      },
      "uuid": "ec43cb04-b043-46ee-a313-3b08447c2b92",
      "value": "Gangster"
    },
    {
      "description": "A mystery story that focuses on homicides. Usually, the detective must figure out who killed one or several victims. They may or may not find themselves or loved ones in danger because of this investigation. The genre often includes elements of the suspense story genre, or of the action and adventure genres.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Crime"
        ]
      },
      "uuid": "8d105f4c-d210-43a4-9ceb-23ee4b17ffe0",
      "value": "Murder mystery"
    },
    {
      "description": "A subgenre of fantasy that can refer to literary, artistic, and filmic works that combine fantasy with elements of horror. The term can be used broadly to refer to fantastical works that have a dark, gloomy atmosphere or a sense of horror and dread and a dark, often brooding, tone.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Fantasy"
        ]
      },
      "uuid": "97daed48-364f-463b-8446-dd7070464dba",
      "value": "Dark fantasy"
    },
    {
      "description": "A literary genre about various magical creatures, environments, et cetera. Many fairy tales are generally targeted for children.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Fantasy"
        ]
      },
      "uuid": "4c42d2e0-242f-4525-a353-f79b976ce19c",
      "value": "Fairy tales"
    },
    {
      "description": "Mythical stories with highly developed characters and story lines. E.g. Malazan Book of the Fallen and The Lord of the Rings",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Fantasy"
        ]
      },
      "uuid": "ad9f917b-2016-4ae8-9b8d-3cc020a9b108",
      "value": "Epic fantasy"
    },
    {
      "description": "subgenre of fantasy that chronicles the tales of heroes in imaginary lands. Frequently, the protagonist is reluctant to be a champion, is of low or humble origin, and has royal ancestors or parents but does not know it. Though events are usually beyond their control, they are thrust into positions of great responsibility where their mettle is tested in a number of spiritual and physical challenges.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Fantasy"
        ]
      },
      "uuid": "3c1fff9f-dad8-414e-99c1-3a6e5249e564",
      "value": "Heroic fantasy"
    },
    {
      "description": "A story with mystical elements that are scientifically explainable, or that combine science fiction elements with fantasy elements. Note that science fiction was once referred to by this name, but that it no longer denotes that genre, and has somewhat fallen out of favor as a genre descriptor.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Fantasy"
        ]
      },
      "uuid": "11c6dfeb-88e1-40ef-9b8b-5cd0a5b90049",
      "value": "Science fantasy"
    },
    {
      "description": "A story about the intrusion of the spirits of the dead into the realm of the living. There are subgenres: The Traditional Haunting, Poltergeists, The Haunted Place or Object (i.e. the hotel in Stephen King's The Shining), or the etching in M. R. James' \"The Mezzotint\", etc. Some would include stories of Revenants such as W. W. Jacobs' \"The Monkey's Paw.\"",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Horror"
        ]
      },
      "uuid": "80cdcd2d-cdd4-4934-94c9-fee62765454c",
      "value": "Ghost story"
    },
    {
      "description": "A story about a monster, creature or mutant that terrorizes people. Usually, it fits into the horror genre, for instance, Mary Shelley's novel Frankenstein. Shelley's Frankenstein is often also considered the first science fiction story (biological science reanimating the dead), but it does present a monstrous \"creature\". Other clear Monster stories are of the creatures of folklore and fable: the Vampire, the Ghoul, the Werewolf, the Zombie, etc. Beings such as that depicted in Karloff's The Mummy would also qualify. ",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Horror"
        ]
      },
      "uuid": "69467e82-a4a0-46b5-9acb-aa45b8d32920",
      "value": "Monster"
    },
    {
      "description": "A horror story about a protagonist in a risky and life-threatening situation that they must endure, often as a result of things such as zombies or other monsters, and the rest of the plot is how the main characters overcome this.",
      "extends_uuid": null,
      "extends_version": null,
      "meta": {
        "kill_chain": [
          "Movie sub-genre:Horror"
        ]
      },
      "uuid": "5e894285-5980-429d-a501-f56ba172ddc3",
      "value": "Survival horror"
    }
  ],
  "version": 1
}
