{
  "authors": [
    "OPM",
    "Jean-Louis Huynen"
  ],
  "category": "workforce",
  "description": "Office of Personnel Management codes in cybersecurity",
  "name": "OPM codes in cybersecurity",
  "source": "https://dw.opm.gov/datastandards/referenceData/2273/current",
  "type": "nice-framework-opm_codes",
  "uuid": "76772dae-0e98-4d96-8603-6993aea936d1",
  "values": [
    {
      "description": "Security Architect - Systems Architecture - Designs enterprise and systems security throughout the development life cycle; translates technology and environmental conditions (e.g., law and regulation) into security designs and processes. (Securely Provision)",
      "related": [],
      "uuid": "cfa862ef-37da-5d24-b941-8ea26fab0770",
      "value": "Security Architect - Systems Architecture - Designs enterprise and systems security throughout the development life cycle; translates technology and e - 652"
    },
    {
      "description": "Enterprise Architect - Systems Architecture - Develops and maintains business, systems, and information processes to support enterprise mission needs; develops information technology (IT) rules and requirements that describe baseline and target architectures.  (Securely Provision)",
      "related": [],
      "uuid": "f9ad751c-5999-518a-ac4c-794598b353f8",
      "value": "Enterprise Architect - Systems Architecture - Develops and maintains business, systems, and information processes to support enterprise mission needs; - 651"
    },
    {
      "description": "Information Systems Security Developer - Systems Development - Designs, develops, tests, and evaluates information system security throughout the systems development life cycle. (Securely Provision)",
      "related": [],
      "uuid": "a2350a52-01aa-5601-88a6-151fd8e103c0",
      "value": "Information Systems Security Developer - Systems Development - Designs, develops, tests, and evaluates information system security throughout the syst - 631"
    },
    {
      "description": "Systems Developer - Systems Development - Designs, develops, tests, and evaluates information systems throughout the systems development life cycle. (Securely Provision)",
      "related": [],
      "uuid": "256698a5-6133-5f00-8016-b9d97f98eeaf",
      "value": "Systems Developer - Systems Development - Designs, develops, tests, and evaluates information systems throughout the systems development life cycle. ( - 632"
    },
    {
      "description": "Software Developer - Software Development - Develops, creates, maintains, and writes/codes new (or modifies existing) computer applications, software, or specialized utility programs. (Securely Provision)",
      "related": [],
      "uuid": "74d99e26-56ed-559d-80e9-a3507ddda56f",
      "value": "Software Developer - Software Development - Develops, creates, maintains, and writes/codes new (or modifies existing) computer applications, software, - 621"
    },
    {
      "description": "Secure Software Assessor - Software Development - Analyzes the security of new or existing computer applications, software, or specialized utility programs and provides actionable results. (Securely Provision)",
      "related": [],
      "uuid": "2aee6e57-ce7c-5b3c-bdfa-23d4de2edbfe",
      "value": "Secure Software Assessor - Software Development - Analyzes the security of new or existing computer applications, software, or specialized utility pro - 622"
    },
    {
      "description": "Partner Integration Planner - Cyber Operational Planning - Works to advance cooperation across organizational or national borders between cyber operations partners. Aids the integration of partner cyber teams by providing guidance, resources, and collaboration to develop best practices and facilitate organizational support for achieving objectives in integrated cyber actions. (Collect and Operate)",
      "related": [],
      "uuid": "4fa5c5c5-56a2-580c-ad81-88acd4639842",
      "value": "Partner Integration Planner - Cyber Operational Planning - Works to advance cooperation across organizational or national borders between cyber operat - 333"
    },
    {
      "description": "Mission Assessment Specialist - All-Source Analysis - Develops assessment plans and measures of performance/effectiveness. Conducts strategic and operational effectiveness assessments as required for cyber events.  Determines whether systems performed as expected and provides input to the determination of operational effectiveness. (Analyze)",
      "related": [],
      "uuid": "7ae513bd-359a-58a5-a54c-948d0d742b5e",
      "value": "Mission Assessment Specialist - All-Source Analysis - Develops assessment plans and measures of performance/effectiveness. Conducts strategic and oper - 112"
    },
    {
      "description": "Target Developer - Targets - Performs target system analysis, builds and/or maintains electronic target folders to include inputs from environment preparation, and/or internal or external intelligence sources.  Coordinates with partner target activities and intelligence organizations, and presents candidate targets for vetting and validation. (Analyze)",
      "related": [],
      "uuid": "6c561f58-1d71-56ee-8cb2-cfdb6a88f17b",
      "value": "Target Developer - Targets - Performs target system analysis, builds and/or maintains electronic target folders to include inputs from environment pre - 131"
    },
    {
      "description": "Target Network Analyst - Targets - Conducts advanced analysis of collection and open-source data to ensure target continuity; to profile targets and their activities; and develop techniques to gain more target information.  Determines how targets communicate, move, operate and live based on knowledge of target technologies, digital networks and the applications on them.  (Analyze)",
      "related": [],
      "uuid": "58fb4487-063f-5eef-bae3-58514f7d4707",
      "value": "Target Network Analyst - Targets - Conducts advanced analysis of collection and open-source data to ensure target continuity; to profile targets and t - 132"
    },
    {
      "description": "Cyber Defense Analyst - Cyber Defense Analysis - Uses data collected from a variety of cyber defense tools (e.g., IDS alerts, firewalls, network traffic logs) to analyze events that occur within their environments for the purposes of mitigating threats. (Protect and Defend)",
      "related": [],
      "uuid": "a74f0438-0593-5ed5-86c0-1e6d03d2a7cc",
      "value": "Cyber Defense Analyst - Cyber Defense Analysis - Uses data collected from a variety of cyber defense tools (e.g., IDS alerts, firewalls, network traff - 511"
    },
    {
      "description": "Cyber Defense Forensics Analyst - Digital Forensics - Analyzes digital evidence and investigates computer security incidents to derive useful information in support of system/network vulnerability mitigation. (Investigate)",
      "related": [],
      "uuid": "976de117-405b-5ae1-9265-329bd70be56f",
      "value": "Cyber Defense Forensics Analyst - Digital Forensics - Analyzes digital evidence and investigates computer security incidents to derive useful informat - 212"
    },
    {
      "description": "Cyber Defense Incident Responder - Incident Response - Investigates, analyzes, and responds to cyber incidents within the network environment or enclave. (Protect and Defend)",
      "related": [],
      "uuid": "7aee9f68-0d0c-59a5-a68a-e3f726d16718",
      "value": "Cyber Defense Incident Responder - Incident Response - Investigates, analyzes, and responds to cyber incidents within the network environment or encla - 531"
    },
    {
      "description": "Systems Requirements Planner - Systems Requirements Planning - Consults with customers to evaluate functional requirements and translate functional requirements into technical solutions. (Securely Provision)",
      "related": [],
      "uuid": "a966ba27-dcd9-561f-b6c5-e0de63087673",
      "value": "Systems Requirements Planner - Systems Requirements Planning - Consults with customers to evaluate functional requirements and translate functional re - 641"
    },
    {
      "description": "System Testing and Evaluation Specialist - Test and Evaluation - Plans, prepares, and executes tests of systems to evaluate results against specifications and requirements as well as analyze/report test results. (Securely Provision)",
      "related": [],
      "uuid": "9a8582a0-4abf-5d4b-8e9a-69666f01cc65",
      "value": "System Testing and Evaluation Specialist - Test and Evaluation - Plans, prepares, and executes tests of systems to evaluate results against specificat - 671"
    },
    {
      "description": "Research & Development Specialist - Technology R&D - Conducts software and systems engineering and software systems research in order to develop new capabilities, ensuring cybersecurity is fully integrated. Conducts comprehensive technology research to evaluate potential vulnerabilities in cyberspace systems. (Securely Provision)",
      "related": [],
      "uuid": "5f61148f-36b7-59ca-9f2d-0e417e78c4c5",
      "value": "Research & Development Specialist - Technology R&D - Conducts software and systems engineering and software systems research in order to develop new c - 661"
    },
    {
      "description": "Cyber Operator - Cyber Operations - Conducts collection, processing, and/or geolocation of systems in order to exploit, locate, and/or track targets of interest. Performs network navigation, tactical forensic analysis, and, when directed, executing on-net operations. (Collect and Operate)",
      "related": [],
      "uuid": "f005bd3f-b89b-553b-9c6a-3f40b01d2533",
      "value": "Cyber Operator - Cyber Operations - Conducts collection, processing, and/or geolocation of systems in order to exploit, locate, and/or track targets o - 321"
    },
    {
      "description": "Cyber Ops Planner - Cyber Operational Planning - Develops detailed plans for the conduct or support of the applicable range of cyber operations through collaboration with other planners, operators and/or analysts. Participates in targeting selection, validation, synchronization, and enables integration during the execution of cyber actions. (Collect and Operate)",
      "related": [],
      "uuid": "5821b257-a530-5a43-a6bb-138e761b530a",
      "value": "Cyber Ops Planner - Cyber Operational Planning - Develops detailed plans for the conduct or support of the applicable range of cyber operations throug - 332"
    },
    {
      "description": "Exploitation Analyst - Exploitation Analysis - Collaborates to identify access and collection gaps that can be satisfied through cyber collection and/or preparation activities. Leverages all authorized resources and analytic techniques to penetrate targeted networks. (Analyze)",
      "related": [],
      "uuid": "272230c9-8ff1-5e2a-aba7-1eedb1571a5b",
      "value": "Exploitation Analyst - Exploitation Analysis - Collaborates to identify access and collection gaps that can be satisfied through cyber collection and/ - 121"
    },
    {
      "description": "Cyber Defense Infrastructure Support Specialist - Cyber Defense Infrastructure Support - Tests, implements, deploys, maintains, and administers the infrastructure hardware and software.  (Protect and Defend)",
      "related": [],
      "uuid": "c3041fb7-e21a-5ed7-96ca-3ef21368d190",
      "value": "Cyber Defense Infrastructure Support Specialist - Cyber Defense Infrastructure Support - Tests, implements, deploys, maintains, and administers the in - 521"
    },
    {
      "description": "Warning Analyst - Threat Analysis - Develops unique cyber indicators to maintain constant awareness of the status of the highly dynamic operating environment.  Collects, processes, analyzes, and disseminates cyber warning assessments. (Analyze)",
      "related": [],
      "uuid": "795ba3a5-cf05-5928-9716-8531fcf05ef3",
      "value": "Warning Analyst - Threat Analysis - Develops unique cyber indicators to maintain constant awareness of the status of the highly dynamic operating envi - 141"
    },
    {
      "description": "Network Operations Specialist - Network Services - Plans, implements, and operates network services/systems, to include hardware and virtual environments. (Operate and Maintain)",
      "related": [],
      "uuid": "faffd034-7d1c-51af-afad-94d3067a3fa9",
      "value": "Network Operations Specialist - Network Services - Plans, implements, and operates network services/systems, to include hardware and virtual environme - 441"
    },
    {
      "description": "System Administrator - Systems Administration - Installs, configures, troubleshoots, and maintains hardware and software, and administers system accounts. (Operate and Maintain)",
      "related": [],
      "uuid": "89068174-997f-55fb-b679-8a40edfb03e7",
      "value": "System Administrator - Systems Administration - Installs, configures, troubleshoots, and maintains hardware and software, and administers system accou - 451"
    },
    {
      "description": "Systems Security Analyst - Systems Analysis - Responsible for the analysis and development of the integration, testing, operations, and maintenance of systems security. (Operate and Maintain)",
      "related": [],
      "uuid": "daa00190-f8ba-53b6-af59-92b6972fff23",
      "value": "Systems Security Analyst - Systems Analysis - Responsible for the analysis and development of the integration, testing, operations, and maintenance of - 461"
    },
    {
      "description": "Technical Support Specialist - Customer Service and Technical Support - Provides technical support to customers who need assistance utilizing client-level hardware and software in accordance with established or approved organizational process components. (i.e., Master Incident Management Plan, when applicable). (Operate and Maintain)",
      "related": [],
      "uuid": "5996cf99-8e3f-51c9-968e-6710f874c9d7",
      "value": "Technical Support Specialist - Customer Service and Technical Support - Provides technical support to customers who need assistance utilizing client-l - 411"
    },
    {
      "description": "Vulnerability Assessment Analyst - Vulnerability Assessment and Management - Performs assessments of systems and networks within the network environment or enclave and identifies where those systems/networks deviate from acceptable configurations, enclave policy, or local policy. Measures effectiveness of defense-in-depth architecture against known vulnerabilities. (Protect and Defend)",
      "related": [],
      "uuid": "aa69a579-b76b-548b-a91e-ceb3a9be8e9e",
      "value": "Vulnerability Assessment Analyst - Vulnerability Assessment and Management - Performs assessments of systems and networks within the network environme - 541"
    },
    {
      "description": "Cyber Crime Investigator - Cyber Investigation - Identifies, collects, examines, and preserves evidence using controlled and documented analytical and investigative techniques. (Investigate)",
      "related": [],
      "uuid": "76708181-9257-5e6f-9270-44447ef43222",
      "value": "Cyber Crime Investigator - Cyber Investigation - Identifies, collects, examines, and preserves evidence using controlled and documented analytical and - 221"
    },
    {
      "description": "Forensics Analyst -  Digital Forensics - Conducts deep-dive investigations on computer-based crimes establishing documentary or physical evidence, to include digital media and logs associated with cyber intrusion incidents. (Investigate)",
      "related": [],
      "uuid": "b896c013-133f-588d-ac11-8ac193158b6c",
      "value": "Forensics Analyst -  Digital Forensics - Conducts deep-dive investigations on computer-based crimes establishing documentary or physical evidence, to  - 211"
    },
    {
      "description": "Data Analyst - Data Administration - Examines data from multiple disparate sources with the goal of providing new insight. Designs and implements custom algorithms, flow processes, and layouts for complex, enterprise-scale data sets used for modeling, data mining, and research purposes. (Operate and Maintain)",
      "related": [],
      "uuid": "d40cf511-e6d2-5e3d-a7e6-cbae85d00375",
      "value": "Data Analyst - Data Administration - Examines data from multiple disparate sources with the goal of providing new insight. Designs and implements cust - 422"
    },
    {
      "description": "Database Administrator - Data Administration - Administers databases and/or data management systems that allow for the storage, query, and utilization of data. (Operate and Maintain)",
      "related": [],
      "uuid": "e68d6562-5b86-5c74-adc6-6bee31632ed3",
      "value": "Database Administrator - Data Administration - Administers databases and/or data management systems that allow for the storage, query, and utilization - 421"
    },
    {
      "description": "Knowledge Manager - Knowledge Management - Responsible for the management and administration of processes and tools that enable the organization to identify, document, and access intellectual capital and information content. (Operate and Maintain)",
      "related": [],
      "uuid": "fff0b409-0769-51b3-b35b-529b7871905f",
      "value": "Knowledge Manager - Knowledge Management - Responsible for the management and administration of processes and tools that enable the organization to id - 431"
    },
    {
      "description": "All Source-Collection Requirements Manager - Collection Operations - Evaluates collection operations and develops effects-based collection requirements strategies using available sources and methods to improve collection. Develops, processes, validates, and coordinates submission of collection requirements. Evaluates performance of collection assets and collection operations. (Collect and Operate)",
      "related": [],
      "uuid": "0307ee23-2e0f-5050-847b-c8932edb59a8",
      "value": "All Source-Collection Requirements Manager - Collection Operations - Evaluates collection operations and develops effects-based collection requirement - 312"
    },
    {
      "description": "Cyber Intel Planner - Cyber Operational Planning - Develops detailed intelligence plans to satisfy cyber operations requirements. Collaborates with cyber operations planners to identify, validate, and levy requirements for collection and analysis. Participates in targeting selection, validation, synchronization, and execution of cyber actions. Synchronizes intelligence activities to support organization objectives in cyberspace. (Collect and Operate)",
      "related": [],
      "uuid": "1e7b3f3d-dfb9-52c5-99e7-77abf6345b2b",
      "value": "Cyber Intel Planner - Cyber Operational Planning - Develops detailed intelligence plans to satisfy cyber operations requirements. Collaborates with cy - 331"
    },
    {
      "description": "Multi-Disciplined Language Analyst - Language Analysis - Applies language and culture expertise with target/threat and technical knowledge to process, analyze, and/or disseminate intelligence information derived from language, voice and/or graphic material.  Creates, and maintains language specific databases and working aids to support cyber action execution and ensure critical knowledge sharing.  Provides subject matter expertise in foreign language-intensive or interdisciplinary projects.  (Analyze)",
      "related": [],
      "uuid": "8a3ee0a0-2beb-5d3c-a013-0a2ad988e399",
      "value": "Multi-Disciplined Language Analyst - Language Analysis - Applies language and culture expertise with target/threat and technical knowledge to process, - 151"
    },
    {
      "description": "All-Source Analyst - All-Source Analysis - Analyzes data/information from one or multiple sources to conduct preparation of the environment, respond to requests for information, and submit intelligence collection and production requirements in support of planning and operations. (Analyze)",
      "related": [],
      "uuid": "e1e3867a-de89-5679-bef9-d2d8ccad23ba",
      "value": "All-Source Analyst - All-Source Analysis - Analyzes data/information from one or multiple sources to conduct preparation of the environment, respond t - 111"
    },
    {
      "description": "All Source-Collection Manager - Collection Operations - Identifies collection authorities and environment; incorporates priority information requirements into collection management; develops concepts to meet leadership's intent. Determines capabilities of available collection assets, identifies new collection capabilities; and constructs and disseminates collection plans.  Monitors execution of tasked collection to ensure effective execution of the collection plan. (Collect and Operate)",
      "related": [],
      "uuid": "00cd33eb-14ac-5ee2-b8df-7d1c33a1d15d",
      "value": "All Source-Collection Manager - Collection Operations - Identifies collection authorities and environment; incorporates priority information requireme - 311"
    },
    {
      "description": "IT Program Auditor - Acquisition and Program/Project Management - Conducts evaluations of an IT program or its individual components, to determine compliance with published standards. (Oversee and Govern)",
      "related": [],
      "uuid": "7b0e3db2-0d1d-5022-8146-654b8c455214",
      "value": "IT Program Auditor - Acquisition and Program/Project Management - Conducts evaluations of an IT program or its individual components, to determine com - 805"
    },
    {
      "description": "Security Control Assessor - Risk Management - Conducts independent comprehensive assessments of the management, operational, and technical security controls and control enhancements employed within or inherited by an information technology (IT) system to determine the overall effectiveness of the controls (as defined in NIST SP 800-37). (Securely Provision)",
      "related": [],
      "uuid": "11e706f0-5ac9-5119-88f2-5f2b46900703",
      "value": "Security Control Assessor - Risk Management - Conducts independent comprehensive assessments of the management, operational, and technical security co - 612"
    },
    {
      "description": "COMSEC Manager - Cybersecurity Management - Manages the Communications Security (COMSEC) resources of an organization (CNSSI 4009). (Oversee and Govern)",
      "related": [],
      "uuid": "6acf0aea-7a0c-5ce0-9e52-23586b66355c",
      "value": "COMSEC Manager - Cybersecurity Management - Manages the Communications Security (COMSEC) resources of an organization (CNSSI 4009). (Oversee and Gover - 723"
    },
    {
      "description": "Cyber Policy and Strategy Planner - Strategic Planning and Policy - Develops cyberspace plans, strategy and policy to support and align with organizational cyberspace missions and initiatives. (Oversee and Govern)",
      "related": [],
      "uuid": "fa181efe-2396-50ec-b0fd-8107c20e8741",
      "value": "Cyber Policy and Strategy Planner - Strategic Planning and Policy - Develops cyberspace plans, strategy and policy to support and align with organizat - 752"
    },
    {
      "description": "Cyber Workforce Developer and Manager - Strategic Planning and Policy - Develops cyberspace workforce plans, strategies and guidance to support cyberspace workforce manpower, personnel, training and education requirements and to address changes to cyberspace policy, doctrine, materiel, force structure, and education and training requirements.  (Oversee and Govern)",
      "related": [],
      "uuid": "443cea4c-f395-5107-8166-d6266a24f7ad",
      "value": "Cyber Workforce Developer and Manager - Strategic Planning and Policy - Develops cyberspace workforce plans, strategies and guidance to support cybers - 751"
    },
    {
      "description": "Cyber Instructional Curriculum Developer - Training, Education, and Awareness - Develops, plans, coordinates, and evaluates cyber training/education courses, methods, and techniques based on instructional needs. (Oversee and Govern)",
      "related": [],
      "uuid": "192e56b0-3f54-59a0-a025-3134c705b913",
      "value": "Cyber Instructional Curriculum Developer - Training, Education, and Awareness - Develops, plans, coordinates, and evaluates cyber training/education c - 711"
    },
    {
      "description": "Cyber Instructor- Training, Education, and Awareness - Develops and conducts training or education of personnel within cyber domain. (Oversee and Govern)",
      "related": [],
      "uuid": "95bd6dc2-0f0c-5c97-b98e-0405dfdb388d",
      "value": "Cyber Instructor- Training, Education, and Awareness - Develops and conducts training or education of personnel within cyber domain. (Oversee and Gove - 712"
    },
    {
      "description": "Cyber Legal Advisor - Legal Advice and Advocacy - Provides legal advice and recommendations on relevant topics related to cyber law. (Oversee and Govern)",
      "related": [],
      "uuid": "18ea5cb6-d1b0-57e2-8efd-157fc99ecee4",
      "value": "Cyber Legal Advisor - Legal Advice and Advocacy - Provides legal advice and recommendations on relevant topics related to cyber law. (Oversee and Gove - 731"
    },
    {
      "description": "Executive Cyber Leadership - Executive Cyber Leadership - Executes decision-making authorities and establishes vision and direction for an organization's cyber and cyber-related resources and/or operations. (Oversee and Govern)",
      "related": [],
      "uuid": "d2577fe1-e906-50d2-b847-2e69939b217d",
      "value": "Executive Cyber Leadership - Executive Cyber Leadership - Executes decision-making authorities and establishes vision and direction for an organizatio - 901"
    },
    {
      "description": "Privacy Compliance Manager - Legal Advice and Advocacy - Develops and oversees privacy compliance program and privacy program staff, supporting privacy compliance needs of privacy and security executives and their teams. (Oversee and Govern)",
      "related": [],
      "uuid": "d0fd9e80-adad-5b55-8ddd-194983576d32",
      "value": "Privacy Compliance Manager - Legal Advice and Advocacy - Develops and oversees privacy compliance program and privacy program staff, supporting privac - 732"
    },
    {
      "description": "Program Manager - Acquisition and Program/Project Management - Leads, coordinates, communicates, integrates and is accountable for the overall success of the program, ensuring alignment with critical agency priorities. (Oversee and Govern)",
      "related": [],
      "uuid": "c6074f56-89a3-5346-bfc0-0d9f0d83b733",
      "value": "Program Manager - Acquisition and Program/Project Management - Leads, coordinates, communicates, integrates and is accountable for the overall success - 801"
    },
    {
      "description": "IT Project Manager - Acquisition and Program/Project Management - Directly manages information technology projects to provide a unique service or product. (Oversee and Govern)",
      "related": [],
      "uuid": "9f8fce0c-5104-5d38-80f2-eee769cfea17",
      "value": "IT Project Manager - Acquisition and Program/Project Management - Directly manages information technology projects to provide a unique service or prod - 802"
    },
    {
      "description": "Authorizing Official/Designating Representative - Risk Management - Senior official or executive with the authority to formally assume responsibility for operating an information system at an acceptable level of risk to organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, and the Nation (CNSSI 4009). (Securely Provision)",
      "related": [],
      "uuid": "268a61ed-fd8a-519d-b1e5-c9e08ceda556",
      "value": "Authorizing Official/Designating Representative - Risk Management - Senior official or executive with the authority to formally assume responsibility  - 611"
    },
    {
      "description": "Product Support Manager - Acquisition and Program/Project Management- Manages the package of support functions required to field and maintain the readiness and operational capability of systems and components. (Oversee and Govern)",
      "related": [],
      "uuid": "3958a3f1-5167-5fa4-bc02-5f13ca88b92a",
      "value": "Product Support Manager - Acquisition and Program/Project Management- Manages the package of support functions required to field and maintain the read - 803"
    },
    {
      "description": "Information Systems Security Manager - Cybersecurity Management - Responsible for the cybersecurity of a program, organization, system, or enclave.  (Oversee and Govern)",
      "related": [],
      "uuid": "c27f0fc5-c667-5b55-b1a6-d6c854dd4c70",
      "value": "Information Systems Security Manager - Cybersecurity Management - Responsible for the cybersecurity of a program, organization, system, or enclave.  ( - 722"
    },
    {
      "description": "IT Investment/Portfolio Manager - Acquisition and Program/Project Management - Manages a portfolio of IT capabilities that align with the overall needs of mission and business enterprise priorities. (Oversee and Govern)",
      "related": [],
      "uuid": "1f81cda9-4c73-5843-8ebc-a8d01a975f97",
      "value": "IT Investment/Portfolio Manager - Acquisition and Program/Project Management - Manages a portfolio of IT capabilities that align with the overall need - 804"
    }
  ],
  "version": 1
}
