{
  "authors": [
    "Various"
  ],
  "category": "actor",
  "description": "List of vendors selling surveillance technologies including malware, interception devices or computer exploitation services.",
  "name": "Surveillance Vendor",
  "source": "MISP Project",
  "type": "surveillance-vendor",
  "uuid": "c3631f86-14f1-11ea-88b0-d37ade2e3f89",
  "values": [
{
"value": "Kape Technologies",
"description": "Kape Technologies is better known by the name under which they were formerly incorporated - \"Crossrider\" but make no mistake they are the same company which became notorious as an adware/malware producer. \nKape Technologies was originally known as Crossrider until the name change in 2018. The reason for that was, as CEO Ido Erlichman put it, “strong association to the past activities of the company.” Perhaps that refers to infecting users’ devices with malware and adware, considered “high-risk” by Symantec and Malwarebytes.\nIf that wasn’t enough, Crossrider’s Founder and first CEO Koby Menachemi, was part of Unit 8200 – something that can be called Israel’s NSA. Another key person, Teddy Sagi, who is the main investor in both Crossrider and Kape Technologies, is mentioned in the Panama Papers.",
"meta": {
  "refs": [
"https://telegra.ph/Private-Internet-Access-VPN-acquired-by-malware-business-founded-by-former-Israeli-spies-12-01"],
  "synonyms": [
    "Kape",
    "Crossrider"
  ],
  "official-refs": [
    "https://www.kape.com/",
    "http://crossrider.com/"
  ]
}
},
{
  "value": "NSO group",
  "description": "NSO Group Technologies is an Israeli technology firm known for its Pegasus spyware enabling the remote surveillance of smartphones. It was founded in 2010 by Niv Carmi, Omri Lavie, and Shalev Hulio. It reportedly employed almost 500 people as of 2017, and is based in Herzliya, near Tel Aviv.",
  "meta": {
    "refs": ["https://en.wikipedia.org/wiki/NSO_Group"]
  },
  "official-refs": ["https://www.nsogroup.com/"]
},
{
  "value":"Hacking Team",
  "description": "HackingTeam is a Milan-based information technology company that sells offensive intrusion and surveillance capabilities to governments, law enforcement agencies and corporations. Its \"Remote Control Systems\" enable governments and corporations to monitor the communications of internet users, decipher their encrypted files and emails, record Skype and other Voice over IP communications, and remotely activate microphones and camera on target computers. The company has been criticized for providing these capabilities to governments with poor human rights records, though HackingTeam states that they have the ability to disable their software if it is used unethically. The Italian government has restricted their license to do business with countries outside Europe.\nHackingTeam employs around 40 people in its Italian office, and has subsidiary branches in Annapolis, Washington, D.C., and Singapore. Its products are in use in dozens of countries across six continents.",
  "meta": {
    "refs":[
      "https://en.wikipedia.org/wiki/Hacking_Team"
    ],
    "synonyms": [
      "Memento Labs"
    ],
    "official-refs":[
      "http://www.mem3nt0.com/about.php"
    ]
  }

},
{
  "value":"Gamma Group",
  "description": "Gamma Group is an Anglo-German technology company that sells surveillance software to governments and police forces around the world. The company has been strongly criticised by human rights organisations for selling its FinFisher software to undemocratic regimes such as Egypt and Bahrain. ",
  "meta": {
    "refs":[
      "https://en.wikipedia.org/wiki/Gamma_Group"
    ],
    "synonyms": [
      "Gamma International"
    ],
    "official-refs":[
      "https://www.gammagroup.com/",
      "https://gamma-international.com/"
    ]
  }
}
  ],

  "version": 1
}
