{
  "authors": [
    "Various"
  ],
  "category": "actor",
  "description": "List of vendors selling surveillance technologies including malware, interception devices or computer exploitation services.",
  "name": "Surveillance Vendor",
  "source": "MISP Project",
  "type": "surveillance-vendor",
  "uuid": "c3631f86-14f1-11ea-88b0-d37ade2e3f89",
  "values": [
    {
      "description": "Kape Technologies is better known by the name under which they were formerly incorporated - \"Crossrider\" but make no mistake they are the same company which became notorious as an adware/malware producer. \nKape Technologies was originally known as Crossrider until the name change in 2018. The reason for that was, as CEO Ido Erlichman put it, “strong association to the past activities of the company.” Perhaps that refers to infecting users’ devices with malware and adware, considered “high-risk” by Symantec and Malwarebytes.\nIf that wasn’t enough, Crossrider’s Founder and first CEO Koby Menachemi, was part of Unit 8200 – something that can be called Israel’s NSA. Another key person, Teddy Sagi, who is the main investor in both Crossrider and Kape Technologies, is mentioned in the Panama Papers.",
      "meta": {
        "official-refs": [
          "https://www.kape.com/",
          "http://crossrider.com/"
        ],
        "refs": [
          "https://telegra.ph/Private-Internet-Access-VPN-acquired-by-malware-business-founded-by-former-Israeli-spies-12-01"
        ],
        "synonyms": [
          "Kape",
          "Crossrider"
        ]
      },
      "uuid": "e42be649-b098-44c7-9275-5874daf3b81a",
      "value": "Kape Technologies"
    },
    {
      "description": "NSO Group Technologies is an Israeli technology firm known for its Pegasus spyware enabling the remote surveillance of smartphones. It was founded in 2010 by Niv Carmi, Omri Lavie, and Shalev Hulio. It reportedly employed almost 500 people as of 2017, and is based in Herzliya, near Tel Aviv.",
      "meta": {
        "official-refs": [
          "https://www.nsogroup.com/"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/NSO_Group"
        ]
      },
      "uuid": "49d8e89f-401d-4d3d-9155-5758a346a4a1",
      "value": "NSO group"
    },
    {
      "description": "HackingTeam is a Milan-based information technology company that sells offensive intrusion and surveillance capabilities to governments, law enforcement agencies and corporations. Its \"Remote Control Systems\" enable governments and corporations to monitor the communications of internet users, decipher their encrypted files and emails, record Skype and other Voice over IP communications, and remotely activate microphones and camera on target computers. The company has been criticized for providing these capabilities to governments with poor human rights records, though HackingTeam states that they have the ability to disable their software if it is used unethically. The Italian government has restricted their license to do business with countries outside Europe.\nHackingTeam employs around 40 people in its Italian office, and has subsidiary branches in Annapolis, Washington, D.C., and Singapore. Its products are in use in dozens of countries across six continents.",
      "meta": {
        "official-refs": [
          "http://www.mem3nt0.com/about.php"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Hacking_Team"
        ],
        "synonyms": [
          "Memento Labs"
        ]
      },
      "uuid": "76c054fd-3f5e-4ea1-ad04-1cffb605c6ed",
      "value": "Hacking Team"
    },
    {
      "description": "Gamma Group is an Anglo-German technology company that sells surveillance software to governments and police forces around the world. The company has been strongly criticised by human rights organisations for selling its FinFisher software to undemocratic regimes such as Egypt and Bahrain. ",
      "meta": {
        "official-refs": [
          "https://www.gammagroup.com/",
          "https://gamma-international.com/"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Gamma_Group"
        ],
        "synonyms": [
          "Gamma International"
        ]
      },
      "uuid": "3786c4c1-c2fc-448d-86a2-9473e699d203",
      "value": "Gamma Group"
    },
    {
      "description": "Flexispy is an application that can be considered as a trojan, based on Symbian. The program sends all information received and sent from the smartphone to a Flexispy server. It was originally created to protect children and spy on adulterous spouses.",
      "meta": {
        "official-refs": [
          "https://www.flexispy.com/"
        ]
      },
      "uuid": "2017228c-57eb-42aa-8397-e88d92d1502e",
      "value": "FlexiSPY"
    },
    {
      "description": "mSpy is probably the most popular monitoring software on the market today. It is designed for parents who want to track their children’s online activity. Using mSpy is easy — just download and install a hidden app on your child’s phone and let it do its thing in the background.\nmSpy is available for iOS and Android, and has a web-based control panel that allows you to remotely monitor activity on your child’s device, including texts, instant messages, phone calls and social media use on Snapchat or Facebook. It also allows you to track the location of your child’s device on a map. The best thing about mSpy is that it works on non-jailbroken iPhones.\nDo note that some of its features, including email tracking and instant messenger monitoring, are only available on a rooted Android smartphone. If you don’t know how to root an Android device, you might want to consider using a spy app like Highster Mobile. This app lets you spy on Android phone without rooting.",
      "meta": {
        "official-refs": [
          "https://www.mspy.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/mspy-review/"
        ]
      },
      "uuid": "40782f51-5d59-42b9-b3ce-bf7d1d4c73ca",
      "value": "mSpy"
    },
    {
      "description": "Highster Mobile is a cell phone spy and monitoring software that allows you to secretly monitor your children, employees, or loved ones without them ever knowing it. The app is available for both Android and iOS devices and is developed by ILF Mobile Apps, a company based in Bohemia, New York, that specializes in mobile security.",
      "meta": {
        "official-refs": [
          "https://www.highstermobi.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/highster-mobile-review/"
        ]
      },
      "uuid": "658c11fa-e6ff-4692-ac8e-dc536167d3e1",
      "value": "Highster Mobile"
    },
    {
      "description": "Mobile Spy is a cell phone monitoring application for iOS, Android and BlackBerry developed by Retina-X Studios. It allows you to monitor the smartphone activity of your children. You’ll be able to see text messages, track GPS locations, monitor social media activities, view call details and more inside a secure online account. Monitoring made easy. Login anytime you wish from any location to see the recorded data without needing access to the monitored phone.\nThe hidden version of Mobile Spy is no longer available due to legal issues.",
      "meta": {
        "official-refs": [
          "http://www.mobile-spy.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/mobile-spy-review/"
        ]
      },
      "uuid": "0b3eb33b-95a6-4da8-9085-278475276073",
      "value": "Mobile Spy"
    },
    {
      "description": "Hoverwatch is a computer and mobile monitoring software developed by Refog. It is available for Android, Windows and macOS. It runs silently in the background, recording all activities performed by the user such as messages sent and received, phone calls made and received, web sites visited, and every keystroke typed. All recorded data is sent to an online account.",
      "meta": {
        "official-refs": [
          "https://www.hoverwatch.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/hoverwatch-review/"
        ]
      },
      "uuid": "a7d4bcf3-6dc9-4d66-98a8-724e9d619a80",
      "value": "Hoverwatch"
    },
    {
      "description": "MobiStealth is a popular spy software that comes with a simple web-based console and powerful monitoring features. It is developed by Infoweise Pty Ltd, a private company headquartered in Sydney, Australia. They have been making high quality monitoring solutions since 2009. In November 2015, they launched a “Non-Jailbreak” feature, letting users spy on all iOS devices without needing to jailbreak them.\nJust like many other spy software, MobiStealth allows you to spy on a cell phone or computer via a web interface called StealthClub. As its name implies, it is a stealth application that runs in the background without the owner’s knowledge.",
      "meta": {
        "official-refs": [
          "https://www.mobistealth.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/mobistealth-review/"
        ]
      },
      "uuid": "a85664ba-67ea-448f-9a9d-7bcf4cedd270",
      "value": "MobiStealth"
    },
    {
      "description": "Spyera develops and sells computer and mobile spy software. Based in Hong Kong, Spyera’s products work in all languages and all countries. The company’s phone and PC monitoring products are useful tools for any parent or company, although they are quite expensive in comparison to other products.\nSpyera comes in three different versions — a mobile version for iPhone and Android smartphones, a tablet version for iPad and Android tablets, and a desktop version for Mac and Windows. The mobile version of Spyera is actually very similar to the FlexiSPY Extreme, which I reviewed a few weeks ago. It has everything you’d expect from a cell phone spy software: live call listening, call recording, and location tracking.",
      "meta": {
        "official-refs": [
          "https://spyera.com/"
        ],
        "refs": [
          "https://www.bestphonespy.com/spyera-review/"
        ]
      },
      "uuid": "24b7fea3-7d2d-4ca4-8941-86cf8ebbf404",
      "value": "Spyera"
    },
    {
      "description": "StealthGenie is a powerful cell phone spy software created by InvoCode Ltd in 2010 that can be used to spy on cheating spouses and monitor children’s activities. In September 2014, Hammad Akbar, founder of StealthGenie, was arrested in Los Angeles and charged with selling mobile device spyware. \nStealthGenie was officially discontinued on 26 September 2014.",
      "meta": {
        "refs": [
          "https://www.bestphonespy.com/stealthgenie-review/"
        ]
      },
      "uuid": "ef236716-10b4-4c50-96db-407b283a0f17",
      "value": "StealthGenie"
    },
    {
      "description": "SpyBubble is a spy app that lets you secretly spy on someone’s phone. This spy app is compatible with a variety of mobile devices, including iPhone, Android, BlackBerry and Symbian, and it offers logging features for most cell phone activity. SpyBubble doesn’t provide the blocking and restricting features that you will find in several similar applications. However, it has many useful features, and its monitoring features are excellent.\nSpybubble cell phone spy software was discontinued due to legal reasons",
      "meta": {
        "refs": [
          "https://www.bestphonespy.com/spybubble-review/"
        ]
      },
      "uuid": "f49bf1b6-e257-4ffc-b5ac-f0e26ef36965",
      "value": "SpyBubble"
    },
    {
      "description": "Cytrox’s Israeli companies were founded in 2017 as Cytrox EMEA Ltd. and Cytrox Software Ltd. Perhaps taking a page from Candiru’s corporate obfuscation playbook, both of those companies were renamed in 2019 to Balinese Ltd. and Peterbald Ltd., respectively. We also observed one entity in Hungary, Cytrox Holdings Zrt, which was also formed in 2017.",
      "meta": {
        "refs": [
          "https://citizenlab.ca/2021/12/pegasus-vs-predator-dissidents-doubly-infected-iphone-reveals-cytrox-mercenary-spyware/"
        ],
        "synonyms": [
          "Cytrox EMEA Ltd.",
          "Cytrox Software Ltd.",
          "Balinese Ltd.",
          "Peterbald Ltd.",
          "Cytrox Holdings Zrt"
        ]
      },
      "uuid": "4dbfa61e-0cf5-4142-babf-3cdce348568d",
      "value": "Cytrox"
    },
    {
      "description": "RCS Lab S.p.A., Italian vendor likely using Tykelab Srl as a front company.",
      "meta": {
        "refs": [
          "https://www.rcslab.it/en/index.html",
          "https://www.lookout.com/blog/hermit-spyware-discovery",
          "https://www.vice.com/en/article/nz75wd/european-surveillance-companies-agt-rcs-sell-syria-tools-of-oppression"
        ]
      },
      "uuid": "28ed79b6-a11d-4e41-af80-ece8f0e0c2d3",
      "value": "RCSLab"
    }
  ],
  "version": 3
}
