{
  "values": [
    {
      "value": "Ideological",
      "description": "The threat actor is motivated by non-specific ideological reasons."
    },
    {
      "value": "Ideological - Anti-Corruption",
      "description": "The threat actor is motivated to attack targets engaging in corruption."
    },
    {
      "value": "Ideological - Anti-Establishment",
      "description": "The threat actor is motivated to attack established authority."
    },
    {
      "value": "Ideological - Environmental",
      "description": "The threat actor is motivated to attack targets engaging in actions determental to the environment."
    },
    {
      "value": "Ideological - Ethnic / Nationalist",
      "description": "The threat actor is motivated to attack targets engaging in actions either against or in favor of a nation state or ethnic group."
    },
    {
      "value": "Ideological - Information Freedom",
      "description": "The threat actor is motivated by the belief in the freedom of information."
    },
    {
      "value": "Ideological - Religious",
      "description": "The threat actor is motivated to attack targets associated with a religion."
    },
    {
      "value": "Ideological - Security Awareness"
    },
    {
      "value": "Ideological - Human Rights",
      "description": "The threat actor is motivated to attack targets engaging in actions either in favor or against human rights."
    },
    {
      "value": "Ego",
      "description": "The threat actor is motivated by enhancing their own self worth."
    },
    {
      "value": "Financial or Economic",
      "description": "The threat actor is motivated by financial gain."
    },
    {
      "value": "Military",
      "description": "The threat actor is motivated by the desire to exercise some military advantage."
    },
    {
      "value": "Opportunistic",
      "description": "The threat actor is motivated by the relative vulnerability of the target."
    },
    {
      "value": "Political",
      "description": "The threat actor is motivated by the desire to exercise some political advantage."
    }
  ],
  "version" : 2,
  "description": "The MotivationVocab is the default STIX vocabulary for expressing the motivation of a threat actor.",
  "source": "STIX 1.0",
  "author": ["STIX"],
  "uuid": "74183277-5ee6-436a-9859-cb16fb3f21e2",
  "stix": "1.2.1",
  "type": "threat-actor-motivation-vocabulary"
}
